abisheksethu/UCOS_EDF_SRP/ce4053/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/OS_RecTask.c
/*
*********************************************************************************************************
*                                              TASK RECURSION CODE
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*
*                                            TASK RECURSION CODE
*
* Filename      : OS_RecTask.c
* Version       : V1.00
* Programmer(s) : Team Tesla
*
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include <includes.h>
#include <stdio.h>
#include "driverlib/timer.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include <os.h>

/*
*********************************************************************************************************
*                                            GLOBAL VARIABLES
*********************************************************************************************************
*/
CPU_INT32U  counter;
extern Tree * RecursionTree;
extern Tree * SchedulerTree;
extern HEAP * HEAP1;
extern Tree * SchedulerTree;
CPU_TS StartTime, StartTime2, OverheadValue2;
/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/*
************************************************************************************************************************
*                                                      OS TASK HANDLER TASK
*
* Description: This task is internal to uC/OS-III and is triggered by the TIMER0A interrupt.
*
* Arguments  : p_arg     is an argument passed to the task when the task is created (unused).
*
* Returns    : none
*
* Note(s)    : This function is INTERNAL to uC/OS-III and your application should not call it.
************************************************************************************************************************
*/

void  OSTaskHandler (void *p_arg)
{
    OS_ERR  err;
    CPU_TS  ts;


    p_arg = p_arg;                                          /* Prevent compiler warning                               */

    while (DEF_ON) {
        (void)OSTaskSemPend((OS_TICK  )0,
                            (OS_OPT   )OS_OPT_PEND_BLOCKING,
                            (CPU_TS  *)&ts,
                            (OS_ERR  *)&err);               /* Wait for signal from tick interrupt                    */
        if (err == OS_ERR_NONE) {
            if (OSRunning == OS_STATE_OS_RUNNING) {
                OSTaskHandlerUpdate();                        /* Update all tasks waiting for time                      */
            }
        }
    }
}

/*$PAGE*/
/*
************************************************************************************************************************
*                                                 INITIALIZE OSTaskLoader TASK
*
* Description: This function is called by OSInit() to create the OSTaskLoader task.
*
* Arguments  : p_err   is a pointer to a variable that will hold the value of an error code:
*
*                          OS_ERR_TICK_STK_INVALID   if the pointer to the tick task stack is a NULL pointer
*                          OS_ERR_TICK_STK_SIZE      indicates that the specified stack size
*                          OS_ERR_PRIO_INVALID       if the priority you specified in the configuration is invalid
*                                                      (There could be only one task at the Idle Task priority)
*                                                      (Maybe the priority you specified is higher than OS_CFG_PRIO_MAX-1
*                          OS_ERR_??                 other error code returned by OSTaskCreate()
*
* Returns    : none
*
* Note(s)    : This function is INTERNAL to uC/OS-III and your application should not call it.
************************************************************************************************************************
*/
void OS_TaskLoaderInit(OS_ERR  *p_err){
  
  #ifdef OS_SAFETY_CRITICAL
    if (p_err == (OS_ERR *)0) {
        OS_SAFETY_CRITICAL_EXCEPTION();
        return;
    }
  #endif
    
  OSTaskCreate((OS_TCB     *)&OSTaskHandlerTCB,
                 (CPU_CHAR   *)((void *)"uC/OS-III OS Recursive Task Handler"),
                 (OS_TASK_PTR )OSTaskHandler,
                 (void       *)0,
                 (OS_PRIO     )OSCfg_TaskHandlerPrio,
                 (CPU_STK    *)OSCfg_TaskHandlerStkBasePtr,
                 (CPU_STK_SIZE)OSCfg_TaskHandlerStkLimit,
                 (CPU_STK_SIZE)OSCfg_TaskHandlerStkSize,
                 (OS_MSG_QTY  )0u,
                 (OS_TICK     )0u,
                 (void       *)0,
                 (OS_OPT      )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                 (OS_ERR     *)p_err);
}
/*
*********************************************************************************************************
*                                          CREATE RECURSIVE TASK AND SCHEDULE
*
* Description : This task is triggered by the TIMER0A interrupt. Based on the task set registered 
*               in the datastructure, it will create a new task with respective to its release time
*
* Arguments   : none
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/

void  OSTaskHandlerUpdate ()
{ 
  CPU_INT32U rel_time = 0;
  CPU_INT32U entry = 0;
  CPU_INT32U abs_deadline = 0;
  Tree *min;
  
  StartTime = OS_TS_GET();
  StartTime2 = OS_TS_GET(); 
  
  /*--------------- FIND MINIMUM TASK RELEASE TIME -------*/    
  min = GetMinRecTree(RecursionTree);
  /**************check if the counter value equals the minimum relese time value***********/
  if( min->release_time == counter )
  { 
    entry = min->entries;
    for(int i=0; (i < entry && i < NUM_OF_TASKS); i++)
    {
      if(min->p_tcb[i]!= NULL)
      { 
        /* --------------- RESET TCB STACK -------*/
        OSTCBStackReset(min->p_tcb[i]);
        /* --------------- ADD TASK TO SCHEDULING LIST -------*/
        abs_deadline = CounterOverflow(min->p_tcb[i]->TaskAbsDeadline + (min->p_tcb[i]->TaskDeadline));
        min->p_tcb[i]->TaskAbsDeadline = abs_deadline;
#if BINOMIAL_DEBUG
        heap_node_create(min->p_tcb[i],min->p_tcb[i]->TaskAbsDeadline);
#endif
#if EDF_DEBUG
        SchedulerTree = InsertEDFTree(min->p_tcb[i]->TaskAbsDeadline,SchedulerTree,min->p_tcb[i]);
#endif
        /* ---------------THEN UPDATE ABSOlUTE RELEASE PERIOD AND ABSOLUTE DEADLINE FOR THE TASK -------*/
        rel_time = CounterOverflow(min->p_tcb[i]->TaskRelPeriod + (min->p_tcb[i]->TaskPeriod));
        min->p_tcb[i]->TaskRelPeriod = rel_time;
        /* --------------- ADD TASK TO RECURSION LIST WITH THE UPDATED RELEASE AND DEADLINE PERIOD-------*/
        RecursionTree = InsertRecTree(rel_time, RecursionTree, min->p_tcb[i]);   
      }
      else
      {
        /* Update the local counter and boundary check */
        counter = CounterOverflow((counter+1));
        return ;
      }
    }
    /* --------------- REMOVE TCB FROM TASK RECURSION LIST -------*/
    RecursionTree = DelRecTree(min->release_time, RecursionTree);
    OSSched();
  }
  /* Update the local counter and boundary check */
  counter = CounterOverflow((counter+1));
  OverheadValue2 = ((OS_TS_GET() - StartTime2)- (StartTime2 - StartTime));
  return ;
}
/*
*********************************************************************************************************
*                                          RESET STACK FOR NEW TASK
*
* Description : Reset TCB stack and initialise to top of the stack
*              
*
* Arguments   : tcb
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/
void OSTCBStackReset(OS_TCB *p_tcb) 
{
    CPU_STK *p_sp;
    CPU_STK_SIZE  i;
    
    /* --------------- CLEAR THE TASK'S STACK --------------- */
    if ((p_tcb->Opt & OS_OPT_TASK_STK_CHK) != (OS_OPT)0) {         /* See if stack checking has been enabled                 */
      if ((p_tcb->Opt & OS_OPT_TASK_STK_CLR) != (OS_OPT)0) {     /* See if stack needs to be cleared                       */
        p_sp = p_tcb->StkBasePtr;
        for (i = 0u; i < p_tcb->StkSize; i++) {               /* Stack grows from HIGH to LOW memory                    */
          *p_sp = (CPU_STK)0;                               /* Clear from bottom of stack and up!                     */
          p_sp++;
        }
      }
    }
    
