abisheksethu/UCOS_EDF_SRP/ce4053/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/OS_RecTask.c
#if OS_CFG_TASK_PROFILE_EN > 0u
    p_tcb->CPUUsage           = (OS_CPU_USAGE   )0u;
    p_tcb->CtxSwCtr           = (OS_CTX_SW_CTR  )0u;
    p_tcb->CyclesDelta        = (CPU_TS         )0u;
    ts                        = OS_TS_GET();                /* Read the current timestamp and save                    */
    p_tcb->CyclesStart        = ts;
    p_tcb->CyclesTotal        = (OS_CYCLES      )0u;
#endif
#ifdef CPU_CFG_INT_DIS_MEAS_EN
    p_tcb->IntDisTimeMax      = (CPU_TS         )0u;
#endif
#if OS_CFG_SCHED_LOCK_TIME_MEAS_EN > 0u
    p_tcb->SchedLockTimeMax   = (CPU_TS         )0u;
#endif

    p_tcb->PendOn             = (OS_STATE       )OS_TASK_PEND_ON_NOTHING;
    p_tcb->PendStatus         = (OS_STATUS      )OS_STATUS_PEND_OK;
    p_tcb->TaskState          = (OS_STATE       )OS_TASK_STATE_DEL;

    //p_tcb->Prio               = (OS_PRIO        )OS_PRIO_INIT;

#if OS_CFG_DBG_EN > 0u
    p_tcb->DbgPrevPtr         = (OS_TCB        *)0;
    p_tcb->DbgNextPtr         = (OS_TCB        *)0;
    p_tcb->DbgNamePtr         = (CPU_CHAR      *)((void *)" ");
#endif
}
/*
*********************************************************************************************************
*                                          RESETTING THE COUNTER
*
* Description : If a 32bit unsigned integer crosses to window 1, it resets to window 0
*
* Arguments   : 32 bit unsigned integer in window 0/1
*
* Returns     : 32 bit unsigned integer in window 0
*
* Notes       : Window 0 --> counter < BORDER_VALUE
*               Window 1 --> counter > BORDER_VALUE
*               Application should use for the 32 bit unsigned integers variables,
*               which are not used for comparision.(lesser than or greater than)
*               
*********************************************************************************************************
*/
CPU_INT32U CounterOverflow (CPU_INT32U counter) {
	CPU_INT32U window = 0;
	window = (counter & BORDER_BIT) >> 31;
	if(window == 1) {
		counter = counter - BORDER_VALUE;
	}
	else {
		counter = counter;	
	}
	return counter;
}